[
  {
    "slug": "becoming-an-international-student",
    "title": "Becoming an International student",
    "date": "22/11/2021",
    "gallery": ["blog1.jpg"],
    "location": "Coventry, United Kingdom",
    "tags": ["university", "placement", "uk"],
    "summary": "I've always had the dream to study in the UK. A country full of opportunities, different cultures and places to discover.",
    "description": "<p>I've always had the dream to study in the UK. A country full of opportunities, different cultures and places to discover.</p><p>When I discovered that I had the chance to enrol on an university in the UK it felt like my dream would finally happen. From the process of sending applications, to creating a portfolio and having interviews it felt like it was taking forever until the offer from the university came.</p><p>The day it did was magical as I had been offered an offer!</p><p>The moment to enter on the new adventure began so I packed my bags and onto the new journey I go!</p><p>From meeting new people, to discovering new cities and learning a whole bunch of new words the dream started!</p><p>It was amazing, all the support, the new learning methods and the people I had the chance to meet changed me as a person and my perspective on all these things.</p><p>I'm very thankful to have the chance to live an old dream I always had!</p>"
  },
  {
    "slug": "how-university-prepares-you-for-placement",
    "title": "How University prepares you for Placement",
    "date": "29/11/2021",
    "gallery": ["blog3.jpg"],
    "location": "Coventry, United Kingdom",
    "tags": ["university", "placement"],
    "summary": "University offers you a lot of different type of support when it comes to Placement year and choosing what to do.",
    "description": "<p>University offers you a lot of different types of support when it comes to Placement and all the challenges it creates.</p><p>In my first year we were briefed on what to do and what not to do at an Internship, this was where I found out that you could participate in a placement year before finishing the course. It felt amazing knowing we had that option and I knew it was perfect for me.</p><p>The support you get in university is amazing, from mental support to help on the application process they make sure you are ready to start and finish your Placement. They are also there throughout the year to provide any kind of support. University offers you a week of workshops and lectures on how to apply and what to do or not if eventually going into an internship.</p><p>We were offered a specialised week on Placement with workshops and lectures on different topics like where to find opportunities, how to build a good CV, et cetera...</p><p>Going on placement right before final year has shown to improve your grades and help in deciding and managing your final year project. You could see this from University alumni who had undertaken placement before final year that would show better results overall.</p><p>It's up to you if you do take the opportunity or not but it's an opportunity that for most comes with endless benefits. With all the support and encouragement you get from all the University staff the process becomes fun and enthusiastic.</p>"
  },
  {
    "slug": "the-first-week",
    "title": "The first week",
    "date": "06/12/2021",
    "gallery": ["blog4.jpg", "blog6.jpg", "blog5.jpg"],
    "location": "Braga, Portugal",
    "tags": ["erasmus", "placement", "university", "portugal", "travel"],
    "summary": "I got an internship in Portugal with Erasmus. I would never think about Portugal as my destination for placement abroad.",
    "description": "<p>I got an internship in Portugal with Erasmus.</p><p>I would never think about Portugal as my destination for placement abroad. It's not that Portugal isn't the place to do it, in fact I'm loving my experience so far, it just made sense when factoring in all the difficulties that 2020 and COVID 19 brought to everyone.</p><p>I'm a UK student doing an Erasmus in my home country, not the choice of many but I am happy with my decision. It might seem like a waste not using this opportunity to travel to a different country but as we all face this sudden lifestyle change what's best than being at home safe with family? And still have the opportunity to grow professionally!</p><p>In my first week of work I've discovered new software, new ways of communicating within the architect's community and new tips to do an efficient and professional job. I was asked to renovate an interior with new software, AutoCAD. I had heard about AutoCAD and 3Ds Max in the past but never used any of them in a project, it was not easy in the beginning but when you want something, you do it even if it takes you some sleep hours.</p><p>During the weekend I went out to explore the city and discover what was new and what was different. It felt so good coming home, and I honestly feel like I never left.</p><p>I've had an amazing week and couldn't ask for a better internship induction.</p>"
  },
  {
    "slug": "creating-professional-projects",
    "title": "Creating professional projects",
    "date": "13/12/2021",
    "gallery": ["blog7.jpg"],
    "location": "Braga, Portugal",
    "tags": ["design", "interior", "architecture", "placement"],
    "summary": "I was assigned a project for the store. One of the most intensive and challenging projects I've ever done in a professional way. I had to design a client's entire house!",
    "description": "<p>I was assigned a project for the store. One of the most intensive and challenging projects I've ever done in a professional way. I had to design a client's entire house!</p><p>The main idea of the project was to give the new home a comfortable and stylish interior, the client wanted a simple but quite unique design.</p><p>For the project development I used AutoCAD for the plans and Enscape and Photoshop for some renderings!</p><p>It's always a challenge working on professional projects for the first time, you learn new things, new working methods and you overcome difficulties that you don't have on personal projects. You need to adapt and not have fear of change.</p><p>But when your on an internship you are there to learn with your mistakes, get up and do better!</p><p>It has been a wonderful experience!</p>"
  },
  {
    "slug": "preparing-for-christmas",
    "title": "Preparing for Christmas",
    "date": "20/12/2021",
    "gallery": ["blog8.jpg", "blog9.jpg", "blog10.jpg"],
    "location": "Braga, Portugal",
    "tags": ["christmas", "interior", "design", "placement"],
    "summary": "Working on an interior design store, I'm not only learning how to design on a professional level but also learning how to manage a store! With that comes managing deliveries, tracking inventory and decorating the store.",
    "description": "<p>Working on an interior design store, I'm not only learning how to design on a professional level but also learning how to manage a store! With that comes managing deliveries, tracking inventory and decorating the store.</p><p>The Christmas time is here and we need to prepare ourselves for the most wonderful time of the year 🎄</p><p>It's amazing seeing that everyone wants to be involved in decorating the store.</p><p>Our plans began by choosing the theme and the colours. We chose red and white for the colours and the theme was Winter Wonderland. After that we began developing mood boards and decorating, and the store became a magical winter place that I loved to enter every day!</p><p>All the images available at <a href='https://www.instagram.com/nc_intdesign/' className='text-decoration-none' rel='noreferrer' target='_blank'>@goodin_interiordesign<i className='fab fa-instagram ms-2'></i></a></p>"
  },
  {
    "slug": "festive-days",
    "title": "Festive days",
    "date": "27/12/2021",
    "gallery": ["blog11.jpg"],
    "location": "Braga, Portugal",
    "tags": ["christmas", "interior", "design", "placement"],
    "summary": "Finally the Christmas week was here! The city was covered in lights and Christmas magic, it was wonderful seeing all the places decorated for this wonderful time.",
    "description": "<p>Finally the Christmas week was here!</p><p>The city was covered in lights and Christmas magic, it was wonderful seeing all the places decorated for this wonderful time.</p><p>Family got reunited, everybody tested for Covid and we had the opportunity to celebrate Christmas and New Year's all together. It was an amazing time spending Christmas at home with the family!</p><p>After working during Christmas time you learn how everything is planned and you get this idea of how things are actually done behind the scenes.</p><p>Having this experience made me more mature and independent, 2 things I'm grateful for!</p>"
  },
  {
    "slug": "i-got-covid",
    "title": "I got Covid!",
    "date": "03/01/2022",
    "gallery": ["blog12.jpg"],
    "location": "Braga, Portugal",
    "tags": ["covid", "selfisolation", "design"],
    "summary": "Dealing with covid and its wonders",
    "description": "<p>As part of being an intern in the store and dealing with a lot of people, I got Covid.</p><p>It was odd in the first days having to stay home in a room isolated but I'm taking the opportunity to rest and enjoy some alone time, I’m not working so it’s been me and myself and it has been amazing.</p><p>We all need some alone time to think about life and appreciate all we have!</p><p>Stay safe and be careful!</p>"
  },
  {
    "slug": "back-to-work",
    "title": "Back to work",
    "date": "10/01/2022",
    "gallery": ["blog13.jpg"],
    "location": "Braga, Portugal",
    "tags": ["interior", "design", "architecture", "placement"],
    "summary": "After having 14 days of self-isolation I felt fine and happy to be back!",
    "description": "<p>After having 14 days of self-isolation I felt fine and happy to be back!</p><p>It's been an interesting roller coaster of emotions and experiences, having work to do, and having the opportunity to make a difference in clients' spaces!</p><p>Never got to do another full house project, only bits and pieces here and there but I’ve been investing in my architectural side and creating stuff for myself and my friends.</p><p>It's good to not give up and continue your journey by learning and experiencing all types of software.</p>"
  },
  {
    "slug": "travelling-through-portugal",
    "title": "Travelling through Portugal",
    "date": "24/01/2022",
    "gallery": ["blog16.jpg", "blog14.jpg", "blog15.jpg"],
    "location": "Serra da Estrela, Portugal",
    "tags": ["travelling", "portugal", "adventure"],
    "summary": "Discovering Serra da Estrela",
    "description": "<p>My boyfriend and I decided to take a week off and explore Serra da Estrela!</p><p>It's a unique and amazing place full of interesting sites to see and explore. We didn't really have the chance to see snow as it is kinda warm here in Portugal at the moment!</p><p>So we took the moment to explore Seia and its wonders! It's a magical little place✨</p><p>We really enjoyed our time there and the chance to know more about nature and Serra da Estrela itself.</p><p>If you ever have the chance to visit Serra do it, you will not be disappointed!</p>"
  },
  {
    "slug": "insight-on-what-i-do",
    "title": "An insight on what I do",
    "date": "01/02/2022",
    "gallery": ["blog17.jpg", "blog18.jpg", "blog19.jpg", "blog20.jpg"],
    "location": "Serra da Estrela, Portugal",
    "tags": ["design", "GoodIn", "showroom", "architecture", "placement"],
    "summary": "What is it like to be an intern and what we do at GoodIn Interior Design",
    "description": "<p>As you know I'm doing my placement year in Portugal. At the moment I'm working at a showroom operating alongside an architect.</p><p>I'm doing all my work desk-based therefore I'm not going to site visits or face-to-face meetings.</p><p>In terms of finding what the client wants sometimes I'm briefed by my manager or sometimes the client comes and meets me in the showroom and we discuss the project.</p><p>My work here is done in a team as my manager and I are side by side working from the showroom; My manager is also my mentor, she helps me a lot in terms of understanding what I need to do. If she's doing the 2D and 3D plans and sketches, I'm working on FF&E and mood boards and vice-versa in order to deliver the best project to the client.</p><p>In terms of Covid regulations for workplaces we don't have many, we only need to keep our maks and try to maintain distance, but as we are the only ones at the showroom it's all manageable.</p><p>We design for everyone, in fact, I make costume built-in cabinets and decor! The company tries to focus more on interiors and we've designed a lot of kitchens since the pandemic, people are more into cooking now :) But that doesn't mean we don't design exteriors, it's just not as common. If you want to change your space just bring your plans and talk to us about what you want to do!</p><p>I love being an Intern at GoodIn, I'm learning but at the same time having fun at what I do! To me, that is one of the most important things I can take from the job.</p><p>Here in the showroom we also sell some decor products and we are open Tuesday to Saturday from 10 am to 7 pm, if you want to come just to have a look at the products you can as well! We are here to welcome you with open arms.</p><p>Come makes us a visit ✨</p>"
  },
  {
    "slug": "getting-ready-for-uni",
    "title": "How I'm getting ready for the last year at Uni",
    "date": "08/02/2022",
    "gallery": ["blog24.jpg"],
    "location": "Coventry, United Kingdom",
    "tags": ["studies", "placement", "university", "work"],
    "summary": "How is the Internship helping me and changing me for the last year of studies?",
    "description": "<p>As you may have read in one of my last posts I'm doing a placement in Portugal, my home country. I've decided to come to Portugal because there's nothing better than being home and having the opportunity to both be working and have your family around.</p><p>The University helps you so much when you choose this path, they explain to you how, why and when you should do your placement and have teams ready for both International and UK-based placements. If you decide you want to experience a placement year you will never feel like you are alone with no help. They have every type of support you can or could ever think of.</p><p>When you feel like it is the right moment to start this journey just talk with the Talent Team, if you are from Coventry University, if not I'm sure your Uni as a support team as well ready to help you out.</p><p>From the moment you first email them, they will never let you go onto the journey alone, you will have support meetings, they will help you make your CV, recommendation letter, and Portfolio if needed.</p><p>The Uni offers you lectures and online material that explain more about placements throughout the years, they will mention placements as early as 1st year so everyone has enough time to make a decision.</p><p>I'm doing a 9-month long placement. I am in the middle of the experience and already feeling more professional and more advanced in different software, types of work and materials. I feel like taking a placement in the middle of the course helps you because you grow as a professional as well as a person but at the same time have an insight into what you'll be doing in the future and if this is actually what you want to do.</p><p>When you have the opportunity to be working without a degree you learn how to work faster but do things with control and value, you learn that every second at work is a chance for you to grow more and more.</p><p>I feel like my placement is helping me become more independent and have a new sense of scale and dimension, this helps a lot when working in interiors. It is also helping me improve my work methods! Everyone needs that in the last year with final year projects. :) It's like having a great opportunity to develop new skills for the future and at the same time learn new tips professionally or not. You develop yourself as an individual.</p><p>Overall my experience is helping me understand what exactly I need to develop as an Interior Architect and how and what I need to deliver.</p>"
  },
  {
    "slug": "its-valentines-day",
    "title": "It's Valentine's Day",
    "date": "14/02/2022",
    "gallery": ["blog22.jpg", "blog21.jpg", "blog23.jpg"],
    "location": "Braga, Portugal",
    "tags": ["travel", "valentines", "work"],
    "summary": "From Your Valentine",
    "description": "<p>Here in the showroom, we live every day and season we have in the year, and as you know February is the month of love.</p><p>At this time we changed the decoration of the store to white and red and created an environment inspired by love! Music and Chocolate never fail, we also had discounts for our loving birds out there!</p><p>As the store was covered in this lovely spirit my boyfriend and I took the inspiration and went to discover a lovely place near Braga, Ponte de Lima! a city full of history and romantic landscapes.</p>"
  },
  {
    "slug": "learning-how-other-people-work",
    "title": "Learning how other people work",
    "date": "20/02/2022",
    "gallery": ["blog25.jpg"],
    "location": "Braga, Portugal",
    "tags": ["GoodIn", "design", "placement"],
    "summary": "I got the opportunity to see how other people in the company work.",
    "description": "<p>I got the opportunity to see how other people in the company work! Although everyone uses the same materials in terms of software people have different ways of working.</p><p>Our company has 2 places that combined are GoodIn, the showroom and a head office both in Braga but with different locations in the city. We do have another architect in the company head office, not working alongside us here in the showroom, but working for GoodIn.</p><p>I've finally got the chance to see how she works and what type of work she has to deliver and it's kinda interesting how in the same company different people in different places can do opposite things. As we in the showroom are more focused on residential and living interiors she in the head office does more of commercial ones, like hotels and shopping stores.</p><p>She does work with the same software that we do but in terms of work, she needs to develop more organized and clean drawings and work, as we are talking about 10 or 15 rooms instead of 1 or 2! The work is basically the same draw the plans, do the elevations and details, mood board to propose the project to the client and then propose the project.</p><p>Although she works with commercial projects, sometimes she has to work on residential ones as well and it was interesting seeing how she develops the same things we do but with a completely different approach.</p><p>As I was taught here in the showroom we firstly are e-mailed by the client with what he wants and needs for the project based on that we develop a presentation with different pictures and ideas and give them a call to come and pop us a visit in the store and have a little chat about the project involved, as we have space and the right materials to do it.</p><p>In the head office the process is a little different as in there we have everyone working as financial people, carpenters, architects and the boss office so the client's approach is different as the architect calls them on a zoom meeting and they discuss everything about the project. After that, the process is the same draw everything and send it to the client for approval! Then if it's approved send everything to production and wait to be finished to be instaled and decorated!</p><p>It was a different week dealing with the first part of the process in a different way but I really liked how it felt, it was good to pop out of my comfort zone and experience new things.</p>"
  },
  {
    "slug": "creating-and-designing-a-kitchen",
    "title": "Creating and designing a kitchen",
    "date": "27/02/2022",
    "gallery": ["blog26.jpg", "blog27.jpg", "blog28.jpg"],
    "location": "Braga, Portugal",
    "tags": ["kitchen", "design", "placement"],
    "summary": "I got another project!",
    "description": "<p>I finally got another project!</p><p>Here at GoodIn we are experts in kitchen design and a lot of people search our work for kitchen renovations. After weeks of learning how to do them, I've finally got the chance to create and design one.</p><p>Although it is a small kitchen we all have to start somewhere, the client had a vision of what she wanted so it was easier to develop the presentation.</p><p>As I explained in the later post we do a presentation to propose the project so my adventure starts there, I had to search out images that would reference what the client wanted and what I could do to modify and make her dream kitchen, after that the whole presentation was developed and I gave her a call to come to the showroom get to know her a little better and explain her the project, as we don't have many covid restrictions we can invite the clients into the showroom, offer a coffee and have a good talk.</p><p>The client was happy about her project and the solutions I had in mind for her kitchen and gave a big YES to my ideas! Then I started to develop her budget which was a great success and invited her again into the showroom so we could choose and discuss the right materials for her space and needs and everything went very professionally and amazing.</p><p>After that, her kitchen went to production and we have an estimated time of 3 months in production so I won't be having the final photos of the project! Which is a shame.</p><p>But overall I'm satisfied how everything went and how I got the chance to interact with a client and develop a work!</p>"
  },
  {
    "slug": "international-womens-day",
    "title": "It's International Women's Day",
    "date": "08/03/2022",
    "gallery": ["blog29.jpg", "blog30.jpg", "blog31.jpg"],
    "location": "Braga, Portugal",
    "tags": ["girlpower", "placement"],
    "summary": "International Women's Day is a day of giving voice!",
    "description": "<p>It's International Women's Day and just like the other festive days we've decorated the showroom to fit the purpose. It's all pink and lovely! Imagine having a gender equal world! A world free of bias, stereotypes and discrimination.</p><p>In 1945, the Charter of the United Nations became the first international agreement to affirm the principle of equality between women and men International Women’s Day first emerged from the activities of labour movements at the turn of the twentieth century across North America and Europe.</p><p>International Women's Day is an occasion to celebrate the progress made towards achieving gender equality and women's empowerment but also to critically reflect on those accomplishments and strive for a greater momentum towards gender equality worldwide. It is a day to recognize the extraordinary acts of women and to stand together, as a united force, to advance gender equality around the world.</p><p>Therefore we want to continue our ancestors' fight and continue to give voice to the problems involving gender equality, which is something we need to teach not to be ashamed of.</p><p>So speak up if you are not happy! We stand with you.</p><p>Information taken from: https://www.internationalwomensday.com/ & https://en.unesco.org/commemorations/womenday</p>"
  },
  {
    "slug": "starting-my-journey-in-the-realistic-renders",
    "title": "Starting my journey in the Realistic Renders",
    "date": "14/03/2022",
    "gallery": ["blog32.jpg"],
    "location": "Braga, Portugal",
    "tags": ["3d", "render", "placement"],
    "summary": "The Real Deal In The 3D World",
    "description": "<p>The 3D world has more to offer than we can ever imagine!</p><p>I met a new friend in the area, you will read much about her in the coming posts, She told me to watch a course that would be happening online for free with huge power onto the rendering side of interior architecture! So I search it and I was amazed when I first saw Ander Alencar, a Brazilian 3D artist, renders they are just like normal pictures as he says pictures that are created in the technical world. I will leave one of his renders and you can check that one and many more on his Instagram: @anderalencar!</p><p>Before starting to explain how everything went let me explain to you what 3D renders are, 3D rendering is the process of turning information from a 3D model into a 2D image you probably came across one of these when seeing cartoons or flipping through a magazine! In fact, this type of image is becoming very popular for people that work with visual stuff, just like us interior architects that have to sell an idea so making that come to life helps us a lot!</p><p>Onto the course week we go:</p><p>The day to start the course came and let me tell you I wasn't too excited at first because my experience with 3D is not the best you learn to work with it in university and stuff but when you enter the professional world and everything is so professionally and carefully made you start to think that maybe investing in your career is the best option so that was what I did. As soon as the class started my mind changed.</p><p>The first class was a theoretical one where we learned about the renders, how can you make them look good and fresh, the different moods that can be used, colours and lens of a photographic cam so you can take pictures of your 3D drawing and make it a 2D image; when you hear this you think, why will I be needing that? Trust me you will, your renders will change completely if you learn about these things, this is the stuff you need to be investing in knowing what's behind.</p><p>The course went smoothly and the following lectures were more about how to sell the drawings, how to edit them and choose your target audience. This last point is a crucial one because choosing your audience will be helping you save a lot of time!</p><p>Although I had to make an effort to attend the course it was a valuable one and I completely advise you to do one as well.</p>"
  },
  {
    "slug": "spring-is-here",
    "title": "Spring Is Here!",
    "date": "21/03/2022",
    "gallery": ["blog33.jpg"],
    "location": "Braga, Portugal",
    "tags": ["spring", "placement"],
    "summary": "The Flowers Start to Bloom and everything Smells Amazing",
    "description": "<p>Spring is here! Time to change the showroom again.</p><p>Lovely colours are brought in and the energy and mood of the store change as everything gets more colourful.</p><p>It's the time to be careful with allergies and the sun starts to set later, my favourite part of the day as I don't like it that much of the nighttime. Let me tell you that changing all of the flower arrangements was a challenge but in the end I made it happen and everything looks very cute, the pink bed stayed because spring is all about colour!</p><p>Spring is the time to start thinking of new chapters and new things to learn and investigate! That said I met Ana, the girl I talked to in the last post she is just the sweetest person and always ready to help others.</p><p>She is in the industry for 5 years now and knows everything about textures, colours, materials and renders so who's better than her to explain to me the new things I want to learn?</p><p>I asked her kindly if she would like to help me grow in the design world and she agreed immediately so my new journey begins.</p><p>As I'm embracing the spring new beginnings vibe I want to be investing in myself in becoming a better designer and architect!</p><p>I've started by learning all the materials an architect needs to know, going back again to my uni notes and asking Ana to help me out as well made me realise that uni gives us all we need we just need to be smarter enough to understand it!</p>"
  }
]
